# BRepBuilderSurfaceGeometry Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BRepBuilderSurfaceGeometry Properties
BRepBuilderSurfaceGeometry Class See Also
---
The BRepBuilderSurfaceGeometry type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
BRepBuilderSurfaceGeometry Class
Autodesk.Revit.DB Namespace